import os

# التوكن من متغيرات البيئة على Northflank
TOKEN = os.getenv("TOKEN")  

# رقم مالك البوت الأساسي
OWNER_ID = int(os.getenv("OWNER_ID", "5010882230"))

# مجموعات البوت المسموح له الدخول لها
ALLOWED_GROUPS = [
    -1002695848824,
    -1003721123319,
    -1002052564369
]

# إعدادات قاعدة البيانات
DATABASE_FILE = "bot_data.db"

# إعدادات النشر التلقائي
POST_INTERVAL = 15  # بالدقائق

# رسائل الترحيب
WELCOME_MESSAGE = (
    "🌹 ادارة قروب مونوبولي ترحب بك اهلا وسهلا 🌹\n"
    "نحن هنا لكي نجعلك سعيدا لا تجعل اللعبة ان تلهيك عن ذكر الله\n"
    "⛔ يمنع اللعب اثناء رفع الاذان واوقات الصلاة\n"
    "⛔ يمنع منعا باتا التواصل مع المشرفات\n"
    "👈 لاي استفسار يرجى التواصل مع Anas او Sakher 👉"
)
# حماية المالك: لا يمكن كتمه أو طرده
PROTECTED_USERS = [OWNER_ID]
