import os

TOKEN = os.getenv("TOKEN")
OWNER_ID = int(os.getenv("OWNER_ID", "5010882230"))

# دعم أكثر من طريقة لإدخال الـ Group IDs
GROUP_IDS_RAW = os.getenv("GROUP_IDS", "")  # يمكن خانة واحدة مفصولة بفواصل
GROUP_IDS_LIST = []

# حاول تحويل كل خانة إلى رقم إذا مفصولة بفواصل
if GROUP_IDS_RAW:
    GROUP_IDS_LIST = [int(g.strip()) for g in GROUP_IDS_RAW.split(",") if g.strip()]

# إعدادات قاعدة البيانات
DATABASE_FILE = "bot_data.db"

# إعدادات النشر التلقائي
POST_INTERVAL = 15  # بالدقائق

WELCOME_MESSAGE = (
    "🌹 ادارة قروب مونوبولي ترحب بك اهلا وسهلا 🌹\n"
    "نحن هنا لكي نجعلك سعيدا لا تجعل اللعبة ان تلهيك عن ذكر الله\n"
    "⛔ يمنع اللعب اثناء رفع الاذان واوقات الصلاة\n"
    "⛔ يمنع منعا باتا التواصل مع المشرفات\n"
    "👈 لاي استفسار يرجى التواصل مع Anas او Sakher 👉"
)

PROTECTED_USERS = [OWNER_ID]
